# Data Wrangling: Join, Combine,

In [15]:
import numpy as np
import pandas as pd
pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

## Hierarchical Indexing

In [3]:
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1   -0.204708
   2    0.478943
   3   -0.519439
b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
d  2    0.281746
   3    0.769023
dtype: float64

In [4]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [6]:
idx = data.index
type(idx)

pandas.core.indexes.multi.MultiIndex

* 부분적 색인으로 접근 partial indexing

In [7]:
data['b']

1   -0.555730
3    1.965781
dtype: float64

In [8]:
data['b':'c']

b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
dtype: float64

In [11]:
data.loc[['b', 'd']]

b  1   -0.555730
   3    1.965781
d  2    0.281746
   3    0.769023
dtype: float64

In [12]:
data.loc[:, 2]

a    0.478943
c    0.092908
d    0.281746
dtype: float64

In [13]:
data

a  1   -0.204708
   2    0.478943
   3   -0.519439
b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
d  2    0.281746
   3    0.769023
dtype: float64

In [14]:
data.unstack()

          1         2         3
a -0.204708  0.478943 -0.519439
b -0.555730       NaN  1.965781
c  1.393406  0.092908       NaN
d       NaN  0.281746  0.769023

In [15]:
data.unstack().stack()

a  1   -0.204708
   2    0.478943
   3   -0.519439
b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
d  2    0.281746
   3    0.769023
dtype: float64

In [16]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [17]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [18]:
frame.columns

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           names=['state', 'color'])

In [19]:
type(frame.index)

pandas.core.indexes.multi.MultiIndex

In [20]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                       names=['state', 'color'])

In [24]:
midx = pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                       names=['state', 'color'])

In [25]:
fm = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=midx)
fm

state  Ohio     Colorado
color Green Red    Green
a 1       0   1        2
  2       3   4        5
b 1       6   7        8
  2       9  10       11

### Reordering and Sorting Levels

In [26]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [28]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [29]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [30]:
frame.swaplevel('key2', 'key1')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [31]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [32]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [36]:
frame.sort_index(level='key2')

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [34]:
frame.sort_index()

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [38]:
frame.sort_index(axis=1)

state     Colorado  Ohio
color        Green Green Red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

In [39]:
frame.sort_index(axis=1, level='color')

state     Colorado  Ohio
color        Green Green Red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

In [40]:
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### Summary Statistics by Level

In [41]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [42]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [43]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [44]:
frame.sum(level='key1')

state  Ohio     Colorado
color Green Red    Green
key1
a         3   5        7
b        15  17       19

In [45]:
frame.sum(level='state', axis=1)

state      Ohio  Colorado
key1 key2
a    1        1         2
     2        7         5
b    1       13         8
     2       19        11

### Indexing with a DataFrame's columns

In [ ]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                      'c': ['one', 'one', 'one', 'two', 'two',
                            'two', 'two'],
                      'd': [0, 1, 2, 0, 1, 2, 3]})
frame

In [ ]:
frame2 = frame.set_index(['c', 'd'])
frame2

In [ ]:
frame2.set_index('a')

In [ ]:
frame.set_index(['c', 'd'], drop=False)

In [ ]:
frame2

In [ ]:
frame2.reset_index()

## Combining and Merging Datasets

### Database-Style DataFrame Joins

In [46]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [47]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                    'data2': range(3)})
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [48]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [49]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [61]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [67]:
df3.sort_values(by=['lkey'])

  lkey  data1
2    a      2
4    a      4
5    a      5
0    b      0
1    b      1
6    b      6
3    c      3

In [65]:
df = pd.DataFrame({
    'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    'col2': [2, 1, 9, 8, 7, 4],
    'col3': [0, 1, 9, 4, 2, 3],
    })
df

  col1  col2  col3
0    A     2     0
1    A     1     1
2    B     9     9
3  NaN     8     4
4    D     7     2
5    C     4     3

In [66]:
df.sort_values(by=['col1'])

  col1  col2  col3
0    A     2     0
1    A     1     1
2    B     9     9
5    C     4     3
4    D     7     2
3  NaN     8     4

In [68]:
df3.sort_values(by=['lkey'])

  lkey  data1
2    a      2
4    a      4
5    a      5
0    b      0
1    b      1
6    b      6
3    c      3

In [69]:
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
                    'data2': range(3)})
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [70]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [71]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [72]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                    'data1': range(6)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [73]:
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
                    'data2': range(5)})

df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [74]:
pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [75]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [76]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                     'key2': ['one', 'two', 'one'],
                     'lval': [1, 2, 3]})
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [77]:
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                      'key2': ['one', 'one', 'one', 'two'],
                      'rval': [4, 5, 6, 7]})
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [79]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [81]:
pd.merge(left, right, how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [87]:
pd.merge(left, right, how='outer', indicator=True)

  key1 key2  lval  rval      _merge
0  foo  one   1.0   4.0        both
1  foo  one   1.0   5.0        both
2  foo  two   2.0   NaN   left_only
3  bar  one   3.0   6.0        both
4  bar  two   NaN   7.0  right_only

In [82]:
pd.merge(left, right)

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  bar  one     3     6

In [83]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [84]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [85]:
pd.merge?

In [86]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'), indicator=True)

  key1 key2_left  lval key2_right  rval _merge
0  foo       one     1        one     4   both
1  foo       one     1        one     5   both
2  foo       two     2        one     4   both
3  foo       two     2        one     5   both
4  bar       one     3        one     6   both
5  bar       one     3        two     7   both

### Merging on Index

In [90]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                      'value': range(6)})
left1.sort_values(by=['key'])

  key  value
0   a      0
2   a      2
3   a      3
1   b      1
4   b      4
5   c      5

In [89]:
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])
right1

   group_val
a        3.5
b        7.0

In [92]:
pd.merge(left1, right1, left_on='key', right_index=True, indicator=True)

  key  value  group_val _merge
0   a      0        3.5   both
2   a      2        3.5   both
3   a      3        3.5   both
1   b      1        7.0   both
4   b      4        7.0   both

In [93]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer', indicator=True)

  key  value  group_val     _merge
0   a      0        3.5       both
2   a      2        3.5       both
3   a      3        3.5       both
1   b      1        7.0       both
4   b      4        7.0       both
5   c      5        NaN  left_only

In [94]:
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio',
                               'Nevada', 'Nevada'],
                      'key2': [2000, 2001, 2002, 2001, 2002],
                      'data': np.arange(5.)})
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [95]:
righth = pd.DataFrame(np.arange(12).reshape((6, 2)),
                      index=[['Nevada', 'Nevada', 'Ohio', 'Ohio',
                              'Ohio', 'Ohio'],
                             [2001, 2000, 2000, 2000, 2001, 2002]],
                      columns=['event1', 'event2'])
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [96]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [97]:
pd.merge(lefth, righth, left_on=['key1', 'key2'],
         right_index=True, how='outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [98]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                     index=['a', 'c', 'e'],
                     columns=['Ohio', 'Nevada'])
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [99]:
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                      index=['b', 'c', 'd', 'e'],
                      columns=['Missouri', 'Alabama'])

right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [101]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True, indicator=True)

   Ohio  Nevada  Missouri  Alabama      _merge
a   1.0     2.0       NaN      NaN   left_only
b   NaN     NaN       7.0      8.0  right_only
c   3.0     4.0       9.0     10.0        both
d   NaN     NaN      11.0     12.0  right_only
e   5.0     6.0      13.0     14.0        both

## join()은 인덱스를 사용한 merge()

In [102]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [103]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [109]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [110]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True) #위와 동일

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [111]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [112]:
right1

   group_val
a        3.5
b        7.0

In [114]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [115]:
pd.merge(left1, right1, how='left', left_on='key', right_index=True) #위와 동일

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [116]:
another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],
                       index=['a', 'c', 'e', 'f'],
                       columns=['New York', 'Oregon'])
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [117]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [118]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [121]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [122]:
left2.join([right2, another], how='outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0
b   NaN     NaN       7.0      8.0       NaN     NaN
d   NaN     NaN      11.0     12.0       NaN     NaN
f   NaN     NaN       NaN      NaN      16.0    17.0

### Concatenating Along an Axis

In [123]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [124]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [125]:
np.concatenate([arr, arr], axis=0)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [126]:
np.concatenate([arr, arr])

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [128]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s1

a    0
b    1
dtype: int64

In [129]:
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s2

c    2
d    3
e    4
dtype: int64

In [130]:
s3 = pd.Series([5, 6], index=['f', 'g'])
s3

f    5
g    6
dtype: int64

In [131]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [132]:
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [135]:
s1

a    0
b    1
dtype: int64

In [136]:
s3

f    5
g    6
dtype: int64

In [137]:
s4 = pd.concat([s1, s3])
s4

a    0
b    1
f    5
g    6
dtype: int64

In [139]:
s1

a    0
b    1
dtype: int64

In [140]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [138]:
pd.concat([s1, s4], axis=1) # join='inner'가 기본

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [141]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  1

In [146]:
pd.concat?

In [147]:
#pd.concat([s1, s4], axis=1, join_axes=[['a', 'c', 'b', 'e']]) #오류

In [148]:
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [149]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [154]:
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [150]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
                   columns=['one', 'two'])
df1

   one  two
a    0    1
b    2    3
c    4    5

In [151]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],
                   columns=['three', 'four'])
df2

   three  four
a      5     6
c      7     8

In [152]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [153]:
pd.concat({'level1': df1, 'level2': df2}, axis=1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [155]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'],
          names=['upper', 'lower'])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [80]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df1

          a         b         c         d
0 -0.204708  0.478943 -0.519439 -0.555730
1  1.965781  1.393406  0.092908  0.281746
2  0.769023  1.246435  1.007189 -1.296221

In [81]:
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])
df2

          b         d         a
0  0.274992  0.228913  1.352917
1  0.886429 -2.001637 -0.371843

In [82]:
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0 -0.204708  0.478943 -0.519439 -0.555730
1  1.965781  1.393406  0.092908  0.281746
2  0.769023  1.246435  1.007189 -1.296221
3  1.352917  0.274992       NaN  0.228913
4 -0.371843  0.886429       NaN -2.001637

In [83]:
pd.concat([df1, df2], ignore_index=False)

          a         b         c         d
0 -0.204708  0.478943 -0.519439 -0.555730
1  1.965781  1.393406  0.092908  0.281746
2  0.769023  1.246435  1.007189 -1.296221
0  1.352917  0.274992       NaN  0.228913
1 -0.371843  0.886429       NaN -2.001637

In [84]:
pd.concat([df1, df2])

          a         b         c         d
0 -0.204708  0.478943 -0.519439 -0.555730
1  1.965781  1.393406  0.092908  0.281746
2  0.769023  1.246435  1.007189 -1.296221
0  1.352917  0.274992       NaN  0.228913
1 -0.371843  0.886429       NaN -2.001637

* append()

In [185]:
df1.append?

In [176]:
df = pd.DataFrame([[1, 2], [3, 4]], columns=list('AB'))
df

   A  B
0  1  2
1  3  4

In [180]:
df2 = pd.DataFrame([[5, 6], [7, 8]], columns=list('AB'))
df2

   A  B
0  5  6
1  7  8

In [182]:
df.append(df2)

   A  B
0  1  2
1  3  4
0  5  6
1  7  8

In [184]:
pd.concat([df, df2])

   A  B
0  1  2
1  3  4
0  5  6
1  7  8

In [ ]:
df.append(df2, ignore_index=True)

In [187]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6]], columns=list('ABC'))
df

   A  B  C
0  1  2  3
1  4  5  6

In [188]:
df2 = pd.DataFrame([[5, 6], [7, 8]], columns=list('AB'))
df2

   A  B
0  5  6
1  7  8

In [189]:
df.append(df2)

   A  B    C
0  1  2  3.0
1  4  5  6.0
0  5  6  NaN
1  7  8  NaN

In [191]:
pd.concat([df, df2])

   A  B    C
0  1  2  3.0
1  4  5  6.0
0  5  6  NaN
1  7  8  NaN

In [192]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6]], columns=list('ABC'))
df

   A  B  C
0  1  2  3
1  4  5  6

In [193]:
df2 = pd.DataFrame([[5, 6, 7], [8, 9, 10]], columns=list('ABD'))
df2

   A  B   D
0  5  6   7
1  8  9  10

In [194]:
df.append(df2)

   A  B    C     D
0  1  2  3.0   NaN
1  4  5  6.0   NaN
0  5  6  NaN   7.0
1  8  9  NaN  10.0

In [196]:
pd.concat([df, df2])

   A  B    C     D
0  1  2  3.0   NaN
1  4  5  6.0   NaN
0  5  6  NaN   7.0
1  8  9  NaN  10.0

### Combining Data with Overlap

In [161]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
              index=['f', 'e', 'd', 'c', 'b', 'a'])
b = pd.Series(np.arange(len(a), dtype=np.float64),
              index=['f', 'e', 'd', 'c', 'b', 'a'])
b[-1] = np.nan

In [162]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [164]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [163]:
np.where(pd.isnull(a), b, a) #a의 값이 널이면 b, 아니면 a(자기 자신)로

array([0. , 2.5, 2. , 3.5, 4.5, nan])

In [165]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [169]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],
                    'b': [np.nan, 2., np.nan, 6.],
                    'c': range(2, 18, 4)})
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.],
                    'b': [np.nan, 3., 4., 6., 8.]})

In [170]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [171]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [172]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

## Reshaping and Pivoting

### Reshaping with Hierarchical Indexing

In [197]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(['Ohio', 'Colorado'], name='state'),
                    columns=pd.Index(['one', 'two', 'three'],
                    name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [198]:
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [199]:
result.index

MultiIndex([(    'Ohio',   'one'),
            (    'Ohio',   'two'),
            (    'Ohio', 'three'),
            ('Colorado',   'one'),
            ('Colorado',   'two'),
            ('Colorado', 'three')],
           names=['state', 'number'])

In [200]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [201]:
result.unstack(0) #unstack('number')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [202]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [203]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])
s1

a    0
b    1
c    2
d    3
dtype: int64

In [204]:
s2

c    4
d    5
e    6
dtype: int64

In [205]:
data2 = pd.concat([s1, s2], keys=['one', 'two'])
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [206]:
data2.index

MultiIndex([('one', 'a'),
            ('one', 'b'),
            ('one', 'c'),
            ('one', 'd'),
            ('two', 'c'),
            ('two', 'd'),
            ('two', 'e')],
           )

In [212]:
data2.unstack() #누락된 데이터 생길 수 있음

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [210]:
# data2.stack() #시리즈는 stack()을 못함

In [213]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [214]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [215]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [216]:
df = pd.DataFrame({'left': result, 'right': result + 5},
                  columns=pd.Index(['left', 'right'], name='side'))
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [217]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [218]:
df.unstack('state').stack('side')

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

In [220]:
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [221]:
df2 = df.unstack('state')
df2

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [222]:
df2.stack()

side             left  right
number state
one    Ohio         0      5
       Colorado     3      8
two    Ohio         1      6
       Colorado     4      9
three  Ohio         2      7
       Colorado     5     10

In [223]:
df2.stack(0)

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

### Pivoting “Long” to “Wide” Format

In [242]:
data = pd.read_csv('examples/macrodata.csv')
data.head()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [243]:
# 시간간격을 나타내기 위한 자료형, 년도와 분기 칼럼을 합치는 작업
periods = pd.PeriodIndex(year=data.year, quarter=data.quarter, name='date')
periods

PeriodIndex(['1959Q1', '1959Q2', '1959Q3', '1959Q4', '1960Q1', '1960Q2',
             '1960Q3', '1960Q4', '1961Q1', '1961Q2',
             ...
             '2007Q2', '2007Q3', '2007Q4', '2008Q1', '2008Q2', '2008Q3',
             '2008Q4', '2009Q1', '2009Q2', '2009Q3'],
            dtype='period[Q-DEC]', name='date', length=203, freq='Q-DEC')

In [245]:
columns = pd.Index(['realgdp', 'infl', 'unemp'], name='item')
columns

Index(['realgdp', 'infl', 'unemp'], dtype='object', name='item')

In [246]:
data

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.980,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.150,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.350,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.370,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.540,139.6,3.50,5.2,180.007,2.31,1.19
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
198,2008.0,3.0,13324.600,9267.7,1990.693,991.551,9838.3,216.889,1474.7,1.17,6.0,305.270,-3.16,4.33
199,2008.0,4.0,13141.920,9195.3,1857.661,1007.273,9920.4,212.174,1576.5,0.12,6.9,305.952,-8.79,8.91
200,2009.0,1.0,12925.410,9209.2,1558.494,996.287,9926.4,212.671,1592.8,0.22,8.1,306.547,0.94,-0.71
201,2009.0,2.0,12901.504,9189.0,1456.678,1023.528,10077.5,214.469,1653.6,0.18,9.2,307.226,3.37,-3.19
202,2009.0,3.0,12990.341,9256.0,1486.398,1044.088,10040.6,216.385,1673.9,0.12,9.6,308.013,3.56,-3.44

In [248]:
data.shape

(203, 14)

In [249]:
data = data.reindex(columns=columns) # 지정된 열에 없는 것은 제외
data

item    realgdp  infl  unemp
0      2710.349  0.00    5.8
1      2778.801  2.34    5.1
2      2775.488  2.74    5.3
3      2785.204  0.27    5.6
4      2847.699  2.31    5.2
..          ...   ...    ...
198   13324.600 -3.16    6.0
199   13141.920 -8.79    6.9
200   12925.410  0.94    8.1
201   12901.504  3.37    9.2
202   12990.341  3.56    9.6

[203 rows x 3 columns]

In [250]:
data.index = periods.to_timestamp('D', 'end')
data

item                             realgdp  infl  unemp
date
1959-03-31 23:59:59.999999999   2710.349  0.00    5.8
1959-06-30 23:59:59.999999999   2778.801  2.34    5.1
1959-09-30 23:59:59.999999999   2775.488  2.74    5.3
1959-12-31 23:59:59.999999999   2785.204  0.27    5.6
1960-03-31 23:59:59.999999999   2847.699  2.31    5.2
...                                  ...   ...    ...
2008-09-30 23:59:59.999999999  13324.600 -3.16    6.0
2008-12-31 23:59:59.999999999  13141.920 -8.79    6.9
2009-03-31 23:59:59.999999999  12925.410  0.94    8.1
2009-06-30 23:59:59.999999999  12901.504  3.37    9.2
2009-09-30 23:59:59.999999999  12990.341  3.56    9.6

[203 rows x 3 columns]

In [251]:
data2 = data.stack()
data2.head(5)

date                           item
1959-03-31 23:59:59.999999999  realgdp    2710.349
                               infl          0.000
                               unemp         5.800
1959-06-30 23:59:59.999999999  realgdp    2778.801
                               infl          2.340
dtype: float64

In [252]:
ldata = data.stack().reset_index().rename(columns={0: 'value'})
ldata

                             date     item      value
0   1959-03-31 23:59:59.999999999  realgdp   2710.349
1   1959-03-31 23:59:59.999999999     infl      0.000
2   1959-03-31 23:59:59.999999999    unemp      5.800
3   1959-06-30 23:59:59.999999999  realgdp   2778.801
4   1959-06-30 23:59:59.999999999     infl      2.340
..                            ...      ...        ...
604 2009-06-30 23:59:59.999999999     infl      3.370
605 2009-06-30 23:59:59.999999999    unemp      9.200
606 2009-09-30 23:59:59.999999999  realgdp  12990.341
607 2009-09-30 23:59:59.999999999     infl      3.560
608 2009-09-30 23:59:59.999999999    unemp      9.600

[609 rows x 3 columns]

In [253]:
ldata[:10]

                           date     item     value
0 1959-03-31 23:59:59.999999999  realgdp  2710.349
1 1959-03-31 23:59:59.999999999     infl     0.000
2 1959-03-31 23:59:59.999999999    unemp     5.800
3 1959-06-30 23:59:59.999999999  realgdp  2778.801
4 1959-06-30 23:59:59.999999999     infl     2.340
5 1959-06-30 23:59:59.999999999    unemp     5.100
6 1959-09-30 23:59:59.999999999  realgdp  2775.488
7 1959-09-30 23:59:59.999999999     infl     2.740
8 1959-09-30 23:59:59.999999999    unemp     5.300
9 1959-12-31 23:59:59.999999999  realgdp  2785.204

In [254]:
pivoted = ldata.pivot('date', 'item', 'value')
pivoted

item                           infl    realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00   2710.349    5.8
1959-06-30 23:59:59.999999999  2.34   2778.801    5.1
1959-09-30 23:59:59.999999999  2.74   2775.488    5.3
1959-12-31 23:59:59.999999999  0.27   2785.204    5.6
1960-03-31 23:59:59.999999999  2.31   2847.699    5.2
...                             ...        ...    ...
2008-09-30 23:59:59.999999999 -3.16  13324.600    6.0
2008-12-31 23:59:59.999999999 -8.79  13141.920    6.9
2009-03-31 23:59:59.999999999  0.94  12925.410    8.1
2009-06-30 23:59:59.999999999  3.37  12901.504    9.2
2009-09-30 23:59:59.999999999  3.56  12990.341    9.6

[203 rows x 3 columns]

In [255]:
ldata['value2'] = np.random.randn(len(ldata)) # 열 value2 추가
ldata[:10]

                           date     item     value    value2
0 1959-03-31 23:59:59.999999999  realgdp  2710.349  0.523772
1 1959-03-31 23:59:59.999999999     infl     0.000  0.000940
2 1959-03-31 23:59:59.999999999    unemp     5.800  1.343810
3 1959-06-30 23:59:59.999999999  realgdp  2778.801 -0.713544
4 1959-06-30 23:59:59.999999999     infl     2.340 -0.831154
5 1959-06-30 23:59:59.999999999    unemp     5.100 -2.370232
6 1959-09-30 23:59:59.999999999  realgdp  2775.488 -1.860761
7 1959-09-30 23:59:59.999999999     infl     2.740 -0.860757
8 1959-09-30 23:59:59.999999999    unemp     5.300  0.560145
9 1959-12-31 23:59:59.999999999  realgdp  2785.204 -1.265934

In [261]:
ldata.pivot?

In [259]:
pivoted = ldata.pivot('date', 'item') #지정하지 않은 열은 자동으로 열이 되어 계층적 열이 됨
pivoted[:5]

                              value                    value2            \
item                           infl   realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00  2710.349   5.8  0.000940  0.523772
1959-06-30 23:59:59.999999999  2.34  2778.801   5.1 -0.831154 -0.713544
1959-09-30 23:59:59.999999999  2.74  2775.488   5.3 -0.860757 -1.860761
1959-12-31 23:59:59.999999999  0.27  2785.204   5.6  0.119827 -1.265934
1960-03-31 23:59:59.999999999  2.31  2847.699   5.2 -2.359419  0.332883


item                              unemp
date
1959-03-31 23:59:59.999999999  1.343810
1959-06-30 23:59:59.999999999 -2.370232
1959-09-30 23:59:59.999999999  0.560145
1959-12-31 23:59:59.999999999 -1.063512
1960-03-31 23:59:59.999999999 -0.199543

In [262]:
pivoted['value'][:5]

item                           infl   realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00  2710.349    5.8
1959-06-30 23:59:59.999999999  2.34  2778.801    5.1
1959-09-30 23:59:59.999999999  2.74  2775.488    5.3
1959-12-31 23:59:59.999999999  0.27  2785.204    5.6
1960-03-31 23:59:59.999999999  2.31  2847.699    5.2

In [263]:
ldata.set_index(['date', 'item'])

                                           value    value2
date                          item
1959-03-31 23:59:59.999999999 realgdp   2710.349  0.523772
                              infl         0.000  0.000940
                              unemp        5.800  1.343810
1959-06-30 23:59:59.999999999 realgdp   2778.801 -0.713544
                              infl         2.340 -0.831154
...                                          ...       ...
2009-06-30 23:59:59.999999999 infl         3.370 -0.074155
                              unemp        9.200 -0.048565
2009-09-30 23:59:59.999999999 realgdp  12990.341  1.235021
                              infl         3.560 -0.433295
                              unemp        9.600  1.391035

[609 rows x 2 columns]

In [264]:
# 피벗은 set_index()로 계층적 색인을 만들고, 다시 unstack()을 사용하는 것과 동일
unstacked = ldata.set_index(['date', 'item']).unstack('item')
unstacked[:7]

                              value                    value2            \
item                           infl   realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00  2710.349   5.8  0.000940  0.523772
1959-06-30 23:59:59.999999999  2.34  2778.801   5.1 -0.831154 -0.713544
1959-09-30 23:59:59.999999999  2.74  2775.488   5.3 -0.860757 -1.860761
1959-12-31 23:59:59.999999999  0.27  2785.204   5.6  0.119827 -1.265934
1960-03-31 23:59:59.999999999  2.31  2847.699   5.2 -2.359419  0.332883
1960-06-30 23:59:59.999999999  0.14  2834.390   5.2 -0.970736 -1.541996
1960-09-30 23:59:59.999999999  2.70  2839.022   5.6  0.377984  0.286350


item                              unemp
date
1959-03-31 23:59:59.999999999  1.343810
1959-06-30 23:59:59.999999999 -2.370232
1959-09-30 23:59:59.999999999  0.560145
1959-12-31 23:59:59.999999999 -1.063512
1960-03-31 23:59:59.999999999 -0.199543
1960-06-30 23:59:59.999999999 -1.307030
1960-09-30 23:59:59.999999999 -0.753887

### Pivoting “Wide” to “Long” Format

In [292]:
df = pd.DataFrame({'key': ['foo', 'bar', 'baz'],
                   'A': [1, 2, 3],
                   'B': [4, 5, 6],
                   'C': [7, 8, 9]})
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [285]:
pd.melt?

In [293]:
melted = pd.melt(df, ['key'])
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [291]:
melted.index

RangeIndex(start=0, stop=9, step=1)

In [294]:
reshaped = melted.pivot('key', 'variable', 'value')
reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

In [295]:
reshaped.reset_index()

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7

In [ ]:
df

In [ ]:
pd.melt(df, id_vars=['key'], value_vars=['A', 'B'])

In [ ]:
pd.melt(df, value_vars=['A', 'B', 'C'])

In [ ]:
pd.melt(df, value_vars=['key', 'A', 'B'])

## Conclusion

## 보강

In [ ]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
df1

In [ ]:
df2 = df1.pivot("도시", "연도")
df2

In [ ]:
df2.columns

In [ ]:
df1.pivot("도시", "연도", "인구")

In [ ]:
df1.set_index(["도시", "연도"])[["인구"]].unstack()

In [ ]:
df1.set_index(["도시", "연도"])

In [ ]:
df1.set_index(["도시", "연도"])['인구'].unstack()

In [ ]:
df1.set_index(["도시", "연도"])[["인구"]].unstack()

In [265]:
* pivot

SyntaxError: can't use starred expression here (<ipython-input-265-eadb4a1159a3>, line 4)

In [278]:
import pandas as pd

df = pd.DataFrame([
        ['20180901', 'A',   10],
        ['20180901', 'B',  100],
        ['20180901', 'C', 1000],
        ['20180902', 'A',   20],
        ['20180902', 'B',  200],
        ['20180902', 'C', 2000],
        ['20180903', 'A',   30],
        ['20180903', 'B',  300],
        ['20180903', 'C', 3000],
], columns=['date', 'typecode', 'volume'])
df

       date typecode  volume
0  20180901        A      10
1  20180901        B     100
2  20180901        C    1000
3  20180902        A      20
4  20180902        B     200
5  20180902        C    2000
6  20180903        A      30
7  20180903        B     300
8  20180903        C    3000

In [279]:
df_pivoted = df.pivot(index='date', columns='typecode', values='volume' )
df_pivoted

typecode   A    B     C
date
20180901  10  100  1000
20180902  20  200  2000
20180903  30  300  3000

In [280]:
df_pivoted.columns.values

array(['A', 'B', 'C'], dtype=object)

In [281]:
df_pivoted.columns = df_pivoted.columns.values
df_pivoted

           A    B     C
date
20180901  10  100  1000
20180902  20  200  2000
20180903  30  300  3000

In [275]:
df_pivoted.reset_index(level=0, inplace=True)
df_pivoted

   index      date   A    B     C
0      0  20180901  10  100  1000
1      1  20180902  20  200  2000
2      2  20180903  30  300  3000

In [282]:
df_pivoted.unstack()

   date
A  20180901      10
   20180902      20
   20180903      30
B  20180901     100
   20180902     200
   20180903     300
C  20180901    1000
   20180902    2000
   20180903    3000
dtype: int64

* melt

In [288]:
df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
                   'B': {0: 1, 1: 3, 2: 5},
                   'C': {0: 2, 1: 4, 2: 6}})
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [289]:
pd.melt(df, id_vars=['A'], value_vars=['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [290]:
pd.melt(df, id_vars=['A'], value_vars=['B', 'C'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [297]:
df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
                   'B': {0: 1, 1: 3, 2: 5},
                   'C': {0: 2, 1: 4, 2: 6}})
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [298]:
df.columns = [list('ABC'), list('DEF')]
df

   A  B  C
   D  E  F
0  a  1  2
1  b  3  4
2  c  5  6

In [299]:
df.melt(col_level=0, id_vars=['A'], value_vars=['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [302]:
df.melt(col_level=0, id_vars=['A'], value_vars=['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [303]:
df.melt(id_vars=[('A', 'D')], value_vars=[('B', 'E')])

  (A, D) variable_0 variable_1  value
0      a          B          E      1
1      b          B          E      3
2      c          B          E      5

In [3]:
mydf = pd.DataFrame({'이름': ['홍길동', '임걱정', '아무개'],
                   '영어': [99, 79, 55],
                   '수학': [92, 82, 72]})
mydf

    이름  영어  수학
0  홍길동  99  92
1  임걱정  79  82
2  아무개  55  72

In [5]:
mydf.melt()

  variable value
0       이름   홍길동
1       이름   임걱정
2       이름   아무개
3       영어    99
4       영어    79
5       영어    55
6       수학    92
7       수학    82
8       수학    72

In [6]:
mydf.melt(id_vars='이름')

    이름 variable  value
0  홍길동       영어     99
1  임걱정       영어     79
2  아무개       영어     55
3  홍길동       수학     92
4  임걱정       수학     82
5  아무개       수학     72

In [7]:
mydf.melt(id_vars='이름', value_vars='영어')

    이름 variable  value
0  홍길동       영어     99
1  임걱정       영어     79
2  아무개       영어     55

In [9]:
mydf.melt(id_vars='이름', value_vars='영어',
         var_name='과목', value_name='점수')

    이름  과목  점수
0  홍길동  영어  99
1  임걱정  영어  79
2  아무개  영어  55

In [10]:
mydf = pd.DataFrame({ '영어': [99, 79, 55],
                    '수학': [92, 82, 72]}, 
                   index = ['홍길동', '임걱정', '아무개'])
mydf

     영어  수학
홍길동  99  92
임걱정  79  82
아무개  55  72

In [11]:
mydf.melt()

  variable  value
0       영어     99
1       영어     79
2       영어     55
3       수학     92
4       수학     82
5       수학     72

In [14]:
mydf.melt().index

RangeIndex(start=0, stop=6, step=1)

# merge와 join 비교

In [29]:
lt = pd.DataFrame([[1, 2], [10, 20]], 
                 index = list('ab'), 
                 columns = list('AB'))
lt

    A   B
a   1   2
b  10  20

In [30]:
rt = pd.DataFrame([[1, 2], [100, 200]], 
                 index = list('ac'), 
                 columns = list('AC'))
rt

     A    C
a    1    2
c  100  200

In [31]:
lt.merge(rt)

   A  B  C
0  1  2  2

In [32]:
lt.merge(rt, how='outer')

     A     B      C
0    1   2.0    2.0
1   10  20.0    NaN
2  100   NaN  200.0

In [33]:
lt.merge(rt, how='left')

    A   B    C
0   1   2  2.0
1  10  20  NaN

In [34]:
lt.merge(rt, how='right')

     A    B    C
0    1  2.0    2
1  100  NaN  200

In [35]:
lt

    A   B
a   1   2
b  10  20

In [36]:
rt

     A    C
a    1    2
c  100  200

In [38]:
lt.join(rt, lsuffix = '_l', rsuffix = '_r')

   A_l   B  A_r    C
a    1   2  1.0  2.0
b   10  20  NaN  NaN

In [39]:
lt.join(rt, how='left', lsuffix = '_l', rsuffix = '_r')

   A_l   B  A_r    C
a    1   2  1.0  2.0
b   10  20  NaN  NaN

In [40]:
lt.join(rt, how='right', lsuffix = '_l', rsuffix = '_r')

   A_l    B  A_r    C
a  1.0  2.0    1    2
c  NaN  NaN  100  200

In [41]:
lt.join(rt, how='inner', lsuffix = '_l', rsuffix = '_r')

   A_l  B  A_r  C
a    1  2    1  2

In [42]:
lt.join(rt, how='outer', lsuffix = '_l', rsuffix = '_r')

    A_l     B    A_r      C
a   1.0   2.0    1.0    2.0
b  10.0  20.0    NaN    NaN
c   NaN   NaN  100.0  200.0

In [48]:
lt = pd.DataFrame([[0, 'a'], [1, 'b']], 
                 columns = list('AB'))
lt

   A  B
0  0  a
1  1  b

In [46]:
rt = pd.DataFrame([[0, 10], [2, 20]], 
                 index = range(0, 3, 2), 
                 columns = list('AC'))
rt

   A   C
0  0  10
2  2  20

In [50]:
lt.merge(rt)

   A  B   C
0  0  a  10

In [51]:
lt.merge(rt, how='outer')

   A    B     C
0  0    a  10.0
1  1    b   NaN
2  2  NaN  20.0

In [52]:
lt.merge(rt, how='left')

   A  B     C
0  0  a  10.0
1  1  b   NaN

In [54]:
lt.merge(rt, how='right')

   A    B   C
0  0    a  10
1  2  NaN  20

In [55]:
lt.join(rt, lsuffix = '_l', rsuffix = '_r')

   A_l  B  A_r     C
0    0  a  0.0  10.0
1    1  b  NaN   NaN

In [56]:
lt.join(rt, how='right', lsuffix = '_l', rsuffix = '_r')

   A_l    B  A_r   C
0  0.0    a    0  10
2  NaN  NaN    2  20

In [57]:
lt.join(rt, how='inner', lsuffix = '_l', rsuffix = '_r')

   A_l  B  A_r   C
0    0  a    0  10

In [58]:
lt.join(rt, how='outer', lsuffix = '_l', rsuffix = '_r')

   A_l    B  A_r     C
0  0.0    a  0.0  10.0
1  1.0    b  NaN   NaN
2  NaN  NaN  2.0  20.0

In [70]:
lt = pd.DataFrame([[99, 77], [96, 66]], 
                 index = ['홍길동', '임걱정'], 
                 columns = ['국어', '영어'])
lt

     국어  영어
홍길동  99  77
임걱정  96  66

In [71]:
rt = pd.DataFrame([[99, 10], [92, 50]], 
                 index = ['홍길동', '별주부'], 
                 columns = ['국어', '수학'])
rt

     국어  수학
홍길동  99  10
별주부  92  50

In [67]:
lt.join(rt, lsuffix='_left')

     국어_left  영어    국어    수학
홍길동       99  77  99.0  10.0
임걱정       96  66   NaN   NaN

In [69]:
lt.merge(rt, how='left')

   국어  영어    수학
0  99  77  10.0
1  96  66   NaN

In [72]:
lt

     국어  영어
홍길동  99  77
임걱정  96  66

In [73]:
rt

     국어  수학
홍길동  99  10
별주부  92  50

In [76]:
pd.concat([lt, rt])

     국어    영어    수학
홍길동  99  77.0   NaN
임걱정  96  66.0   NaN
홍길동  99   NaN  10.0
별주부  92   NaN  50.0

In [77]:
pd.concat([lt, rt], join='outer')

     국어    영어    수학
홍길동  99  77.0   NaN
임걱정  96  66.0   NaN
홍길동  99   NaN  10.0
별주부  92   NaN  50.0

In [78]:
pd.concat([lt, rt], join='inner')

     국어
홍길동  99
임걱정  96
홍길동  99
별주부  92

In [85]:
pd.concat([lt, rt], axis=1)

       국어    영어    국어    수학
홍길동  99.0  77.0  99.0  10.0
임걱정  96.0  66.0   NaN   NaN
별주부   NaN   NaN  92.0  50.0

In [86]:
pd.concat([lt, rt], axis=1, join='outer')

       국어    영어    국어    수학
홍길동  99.0  77.0  99.0  10.0
임걱정  96.0  66.0   NaN   NaN
별주부   NaN   NaN  92.0  50.0

In [87]:
pd.concat([lt, rt], axis=1, join='inner')

     국어  영어  국어  수학
홍길동  99  77  99  10

In [88]:
lt

     국어  영어
홍길동  99  77
임걱정  96  66

In [89]:
lt.stack()

홍길동  국어    99
     영어    77
임걱정  국어    96
     영어    66
dtype: int64

In [90]:
lt.stack().unstack()

     국어  영어
홍길동  99  77
임걱정  96  66

In [ ]:
multicol2 = pd.MultiIndex.from_tuples([('weight', 'kg'),
                                       ('height', 'm')])
df = pd.DataFrame([[1.0, 2.0], [3.0, 4.0]],
                  index=['cat', 'dog'],
                  columns=multicol2)

In [93]:
df

    weight height
        kg      m
cat    1.0    2.0
dog    3.0    4.0

In [94]:
df.stack()

        height  weight
cat kg     NaN     1.0
    m      2.0     NaN
dog kg     NaN     3.0
    m      4.0     NaN

* pivot

In [104]:
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two', 'two'],
                   'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'baz': [1, 2, 3, 4, 5, 6],
                   'zoo': ['x', 'y', 'z', 'q', 'w', 't']}, 
                    index = list('abcdef'))
df

   foo bar  baz zoo
a  one   A    1   x
b  one   B    2   y
c  one   C    3   z
d  two   A    4   q
e  two   B    5   w
f  two   C    6   t

In [108]:
df.pivot(columns='bar')

     foo            baz            zoo
bar    A    B    C    A    B    C    A    B    C
a    one  NaN  NaN  1.0  NaN  NaN    x  NaN  NaN
b    NaN  one  NaN  NaN  2.0  NaN  NaN    y  NaN
c    NaN  NaN  one  NaN  NaN  3.0  NaN  NaN    z
d    two  NaN  NaN  4.0  NaN  NaN    q  NaN  NaN
e    NaN  two  NaN  NaN  5.0  NaN  NaN    w  NaN
f    NaN  NaN  two  NaN  NaN  6.0  NaN  NaN    t

In [106]:
df.pivot(index='foo', columns='bar')

    baz       zoo
bar   A  B  C   A  B  C
foo
one   1  2  3   x  y  z
two   4  5  6   q  w  t

In [107]:
df.pivot(index='foo', columns='bar', values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [111]:
df.pivot_table(index='foo', columns='bar')

    baz
bar   A  B  C
foo
one   1  2  3
two   4  5  6